package oop2;

public class Ex_07_06 {

	public static void main(String[] args) {

//		[7-6] 자손 클래스의 생성자에서 조상 클래스의 생성자를 호출해야하는 이유는 무엇인
//		가?
		
		
		// 생성자: 객체 초기화 
		//조상 클래스에 있는 iv를 초기화하기 위해서?
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		//  자손클래스의 인스턴스를 생성하면 조상으로부터 상속받은 인스턴스변수들도 생성
	   //	되는데 이 상속받은 인스턴스변수들 역시 적절히 초기되어야 한다
		
		//각 클래스의 생성자는 해당 클래스에 선언된 인스턴스변수의 초기화만을 담당하고 조상 ,
		//클래스로부터 상속받은 인스턴스변수의 초기화는 조상클래스의 생성자가 처리하도록 해야
//		하는 것이다

		
	}

}
