package oop2;

public class Ex_07_03 {

	public static void main(String[] args) {

		
		//[7-3] 오버라이딩의 정의와 필요성에 대해서 설명하시오.
		
		 /*
		  *  오버라이딩은 상속 관계에서 나올 수 있다
		  *  
		  *  오버로딩은 같은 이름의 새로운 메서드를 생성하는거라고하면 
		  *  오버라이딩은 메서드를 수정하는 것..
		  *  
		  *  부모 클래스에서 상속 받은 메서드를 사용하기 위해서..
		  *  
		  *  
		  *  
		  * 
		  * 
		  *
		  * 
		  * 
		  * 
		  * 
		  * 
		  * 
		  * 오버라이딩 이란 조상 클래스로부터 상속받은 메서드를 자손 클래스에 맞게
		  *  재정의 하는 것 을 말한다 
		  *  조상 클래스로부터 상속받은 메서드를 자손 클래스에서 그대로 사용할 수 없는 경우가
		  *  많기 때문에 오버라이딩이 필요하다
		  * 
		  * 
		  * 
		  * 
		  * */
	}

}
