package oop2;

public class Ex_07_09 {

	public static void main(String[] args) {

//		
//		[7-9] 다음 중 제어자 final을 붙일 수 있는 대상과 붙였을 때 그 의미를 적은 것이다.
//		옳지 않은 것은? (모두 고르시오)
//		a. 지역변수 - 값을 변경할 수 없다.
//		b. 클래스 - 상속을 통해 클래스에 새로운 멤버를 추가할 수 없다.
//		c. 메서드 - 오버로딩을 할 수 없다.
//		d. 멤버변수 - 값을 변경할 수 없다.
		
		
		// 답안 : c  오버라이딩을 할 수 없다
		
		
		
		
		
		
		
//		
//		 제어자 final은 마지막의 또는 변경될 수 없는 의 의미를 가지고 있으며 거의 
//		 모든 대상에 사용될 수 있다.
//		
//		클래스 -클래스 변경될 수 없는 클래스 확장될 수 없는 클래스가 된다 , .
//		그래서 로 지정된 클래스는 다른 클래스의 조상이 될 수 없다  .
//		
//		메서드 - 변경될 수 없는 메서드 final로 지정된 메서드는 오버라이딩을 통해 , 
//		재정의 될 수 없다.
//		
//		(지역변수,멤버변수)변수 앞에 final이 붙으면 값을 변경할 수 없는 상수가 된다  , .
		

		
		
	}

}
